{"podcast_details": {"podcast_title": "With Great Power", "episode_title": "Preparing the grid for millions more electric cars", "episode_image": "https://image.simplecastcdn.com/images/f743f9e0-8ec4-43dc-8361-431829f4c096/cd561722-0d85-4628-aaa4-87ff8a0ead00/3000x3000/gx2-wgp-3000x3000.jpg?aid=rss_feed", "episode_transcript": " From the start, Apurva Bhargava knew he wanted to help make the energy transition a reality as quickly as possible. I'm an energy wonk through and through. I was a chemical engineer and an energy economist in college. And in that first wave of clean tech, I thought I was going to go invent the next battery or something. But I ended up deciding that spending that much time in labs wasn't going to be my forte. Back in the early days of his clean tech career at Boston Consulting Group, he took on an associate role with the hopes of combating climate change on the corporate level. And utilities were a primary client of mine. And really, it was such an interesting place to learn about the sector, but also see how you could scale these really powerful tools really, really quickly. Each conversation with the utility, it felt like a milestone. Apurva knew that major strides towards decarbonization would mean pushing hard on the utilities. And BCG was leading that push by forming plans and guiding investments in DERs, smart grid tech, and electric vehicles. EVs, he realized later on, were a huge part of the decarbonization puzzle. Transportation and electricity combined make up over 60 percent of emissions in this country. And we are standing in that moment, right at the doorstep of that moment, where vehicle electrification is taking off. And it's the coming together of the two massive sectors that combined have an opportunity to really drive down large scale decarbonization. But actually making that happen could be an incredibly expensive undertaking. At the time, utilities across the country were not prepared for the costs of onboarding the millions of EVs needed on the road. A 2019 report from Boston Consulting Group found that it could cost the utility of two to three million customers anywhere between $1,700 and $5,800 in grid upgrades per EV. Obviously, Apurva and his team want to avoid that. Now, as CEO and co-founder of WeaveGrid, he's asking one question. What if we could leverage all these new EVs as a grid resource, one that could benefit drivers, utilities, and the grid as a whole? It's one thing to go put a battery in someone's home. It's another thing to go put a battery on a feeder. It's another thing to go put a battery in a building, in the basement of a building. But what if somebody just bought the battery? And what if that battery was actually far more valuable for a completely different resource and a completely different application, rather, versus energy? And that application is transportation. And so it just became so obvious that as transportation electrification took off, there was an opportunity, if you had a customer's trust, if you knew how to actually optimize what you were doing, to deliver a lot more value to the entire system. WeaveGrid provides utilities with the software to connect with current EV owners and get more EVs on the grid by using data to anticipate demand in different areas. And electric vehicles fundamentally changed that model because there's 120 million households in the country. There's 280 million cars. And if you take each and every one of those and start thinking about what happens as they start charging anywhere between five to 20 kilowatts at home, it is a radical transformation. And so what WeaveGrid's technology really does is it tries to solve for every element in that equation and do so in the most cost-effectively possible. This is With Great Power, a show about the people building the future grid today. I'm Brad Langley. Some people say utilities are slow to change, they don't innovate fast enough. And while it might not always seem like the most cutting edge industry, there are lots of people working really hard to make the grid cleaner, more reliable, and customer centric. This week, I'm speaking with Apoorv Bhargava, CEO and co-founder of WeaveGrid. After more than a decade working on the energy transition in different capacities, Apoorv combined his experience in tech consulting and business by launching WeaveGrid with co-founder John Taggart in 2018. By using machine learning and AI to track and predict things like driving and charging patterns, EV growth, and transmission capacity, WeaveGrid is getting more EVs on the road at lower cost to owners and the grid. It shows just how much need there is in this moment and how much I think utilities are willing to innovate to try and take advantage again of this huge shift that's happening in consumer behavior. In the five years since their founding, they're already making huge waves across the industry. Some of WeaveGrid's customers include major utilities like PG&E, Excel, Dominion, Baltimore Gas and Electric, and other excellent utilities. So, you know, we're touching already tens and thousands, several tens of thousands of drivers and being able to help them save costs and really doing it in a way where drivers are frankly seeing it done seamlessly, where you don't have to think where you go home and you plug into your car. And at the end of the day, it's giving you a fully charged vehicle, but doing so such that it actually optimizes the whole system. I talked with a poor about how WeaveGrid's technology is built to serve the interests of customers and utilities alike, and the levers needed to spur change in the private sector. We started our conversation by getting a poor's take on the deeper connection between energy and transportation. Oh, philosophically, they're the same thing, right? Transportation also requires energy. But I would say when you come down to it, these are actually electricity and mobility, especially on the automotive side. These are both 100 year old industries, like pretty much exactly about the same time frame. And, you know, we made a societal decision in the early 1900s based off of the technologies at the time to go down a pathway where we started using internal combustion engines. There were electric vehicles 100 years ago. I actually have a map of charging stations in Chicago in 1916 in my apartment that I love to look at to remind myself that 100 years later, you know, we're just starting again. But the funny thing is 100 years ago, we had EVs, right? In fact, Henry Ford's wife drove an electric car. But due to a combination of technologies, a combination of other factors, we ended up going down this pathway where we chose to consume the fossil fuel driven internal combustion engine vehicles that we did. And I think we're in a moment here where we are getting to redefine and re-choose what our energy future is going to look like. And I use energy big E here, not just electricity. It just so happens that electricity is that ultimate fuel that can be, you know, cleaned much faster than any fossil fuel. It's also one where we've already built out the system. The system is incredible and it's there and it's available and we can use it. Right. It also builds, you know, it enables us to build and be fueling the most efficient kind of vehicle possible, which is an electric vehicle. So there's just like so many advantages. But these are both 100 year old sectors that are learning how to redefine and reimagine themselves. And it's a privilege to sit between them both as they're trying to figure that out. But, you know, if we had infinite time, then I would say let's keep figuring it out together. Let's take our time. Let's like just, you know, let's do the right step one step at a time. We just have to keep moving forward faster. I have no idea that Henry Ford's wife drove an EV that's pretty fascinating. It's actually were chargers in Chicago. So, you know, knowing that, you know, what are some of the factors that are hurting the proliferation of technologies like EVs on a broader scale? You know, I think I think the biggest thing right now is it is sort of reimagining that supply chain that slows down the ability to go build hundreds of millions of vehicles in the same way that we today build hundreds of millions of ice vehicles. At the end of the day, we have to be able to re-architect the vehicles. We have to be able to build those vehicles with the labor and the capital that we have out there, you know, whether it be in factories and unions and so forth. We have to be able to provide the fuel for it, which means having adequate charging infrastructure. But it isn't just charging infrastructure. It's also the grid infrastructure that goes with charging infrastructure. We have to be able to source all the critical minerals. We have to be able to do all of those things. And by the way, we have to do that really, really, really fast. We don't have another century within which we can do that. And that just takes, you know, inherently there is inertia and there is a lot of like, yeah, I mean, there's a lot of basically re-innovation that needs to happen within 100 year old companies. Are you confident in how well car companies and energy companies are working together? Do you think they're moving harmoniously forward? Is there more work that needs to be done to kind of sync those two entities? I think both automotive companies and utility companies understand where the end state needs to be. I think each of them has a series of different challenges that they need to solve for themselves. And so they are, I think, both very open and willing to learn from one another, but they absolutely do not work in the same ways and do not, are not like, you know, harmoniously cooperating in that sense. I mean, it's really the reason that companies like, mine exists, right? It's like why we've heard exists. It's because we have to act as not just a technology bridge between those two sides, but also a relationship and a language bridge, which is how do you help explain to folks who have spent the last 40 years building exceptional drivetrains, what it means for that drivetrain to now be deployed and be having an impact on a feeder? And how do you explain to folks who view load as load, but also say that load might move tomorrow because somebody needs to go pick up ice cream in the middle of the night because their kid is yelling at them? And so there is a whole different, you know, set of customer experiences that both sides are incredibly knowledgeable about. But how they work in tandem, that part is often really missing, right? And so that's why companies like WeaveGrid exist so that we can help bridge that. So now that you're running WeaveGrid, how does managing or running your own startup compare to the rest of your career? Oh, it's both the most thrilling experience of my life. It's also the hardest. It's also so much fun. I mean, I'm learning every day. I'm constantly inspired by the people who I work with. I don't know. It's just a ton of imposter syndrome. It's awesome. I mean, I love it. I think, you know, folks always ask me like, well, what motivated you to start the company? And I was like, honestly, I just I wanted to solve the problem. I was like, I could see a problem. I could see it on the horizon. I could see it 10 years out. And I couldn't see anyone else trying to really tackle it. And so I said, well, what are the skills that I have? What is the knowledge I have? How do I bring those things together? And how do I go build something that can actually go tackle a real problem that matters to me and I think will matter a lot to the world? And what do you see some of the biggest challenges you're facing with getting your technology into the hands of users? I think right now and I've heard some of your other previous previous participants on the podcast say this. Like there is still inherently a look utilities are regulated industries and roughly. So there is a there's a challenge, though, which is how do you get the regulatory framework to adapt quickly enough to what is an exponential problem? Because I've heard this again and again, and I think utilities are very right in saying this. If we come to you, the regulator, when the problem is here and now, it is too late. Right. But if we come to you today when we know the problem isn't here yet and we proactively ask you for something, we get told, hey, you're jumping ahead of the problem. There isn't a problem today. We have to move into a mindset of being proactive from a regulatory framework perspective. And we also have to move into a faster into a faster sort of feedback loop. Right. Every week I have clients around the country where hundreds or thousands of new EVs are being sold in their territories. Right. Every single week. That is megawatts on megawatts of new load coming online. If a megawatt of load came online in a neighborhood, normally you would put that through an interconnection cycle that would take probably close to a couple of years. Well, what if that happens every week because more and more cars get sold? That's what's happening. And our frameworks, especially as you think about planning and integrated grid planning in particular, and you think about, you know, sort of the framework of going back to regulators and asking them for permission to do things and this and that, it's just very slow compared to the way that this is happening. And so I think there needs to be some sort of balance that we reach where we say, OK, let's revisit these questions maybe every six months, maybe every year, and actually do so in a way where we're only asking a series of five to six questions instead of 35 questions that we would ask every three years. But let's do that quickly so that we're taking advantage of the scale and the speed with which EVs are coming and we're able to leverage them as that resource that we want. So I think that's one thing. And then, you know, it's also it's often inertia. It's often just a lot of inertia as well within within a lot of industries where folks are used to doing things in one way. And now you've got to get used to doing it in a very, very different way. So that's that's I think that's honestly the biggest challenge is I often see. So this is obviously a blanket statement because there's obviously lots of regulators that are doing innovative stuff. But like, you know, it's a common theme we hear on the show is it can be a harbinger of success. So are there certain levers we can pull to accelerate that regulatory piece of this to accelerate the innovation? I mean, look, we one of our first customers was Baltimore Gas and Electric, one of the excellent companies and and Chairman Stanek, who is the chairperson of the of the Maryland PSC. He was he was he's just retired. And, you know, folks like him and others not only were so progressive in how they thought about saying, OK, I like this new approach. I'm willing to give it, you know, the rope to be tested. Let's try it out and see what impacts and and value it creates. Ultimately, you know, regulators in particular are striving to to to serve customers and ensure that any any approach taken by utilities is cost effective and is in line with the goals of affordability, reliability and cleanliness. And I think I think like having the principles clearly outlined, but giving utilities the room to play in the sandbox is really critical. Right. Because the technology is changing every single day. What we were doing four years ago is radically different at a technological capacity level from what we are doing today. And so I just think that that's the kind of framework which we need to have. And that's just one company, by the way. Right. There's a lot of other companies that are coming out and doing amazing things every day. That technology is going down a learning curve. It's changing. And I think regulators need to provide that space for utilities to really experiment. So that's that's how I often think about it is like set the goals and the timelines and then give people the space to kind of experiment and try new things. I feel like we've seen utilities start to become a sexy place to work, for lack of a better term, in part because of all the great energy work that's being done. Are you seeing that translate to regulators as well? Are we seeing kind of new bright and obviously they're all bright. I'm not trying to say they aren't. But like are we seeing kind of a new generation of talent think I want to get into regulatory commission so I can help accelerate this transition? Let me answer both. I mean, I think one of the places or well, definitely two places, but the one that I interact the most with at utilities is transportation electrification. And so you've got incredibly smart people and let me tell you, incredibly motivated people, right? People who who probably are better environmentalists than me and people who like truly care about climate like at down to the last fiber of their body. So you've got folks like that working inside of utilities, particularly in the renewable side, the electrification side, a lot of that. I've seen that change happen even within my my time frame, my career time frame. At the regulatory level, I find that that often exists at a staff level. Right. There's a lot of stuff who come in and are just like truly very motivated by the goals of decarbonizing the grid, decarbonizing the energy sector. And I'm really inspired by some of those people. And yes, there's a lot of fresh, new, young, hungry talent who wants to help that. It's not that they don't want to do the right things. It's often that the frameworks that exist, the laws and the regulations that allow them to do their job, still live, though, in a, you know, 10 years ago framework or 20 years ago framework or 50 years ago framework. Right. They've just haven't been able to update the governing laws that allow them to do their job and allow them to go out there and say, hey, how about we experiment more and so forth. So I find that it's less a talent problem and it's often more a what are you allowed to do now that you are a talented person who is there. And, you know, we've we've we've got an active policy and regulatory team who works really closely with a lot of regulators to help educate them. And frankly, most regulators that we meet are just so excited by what they hear about what we're doing, because it's again in line with the goals that they have to, which is ensure reliability, affordability and cleanliness. And I think that's been that's been great to see. Is there, you know, can we see more more talent go into that space? Absolutely. You know, I often tell friends who are like, I really want to work in energy and great figure out how you go become a regulator. And they're like, what? Like, yeah, no, seriously. Don't don't come and tell me you want to do A.I. and energy. Go figure out how you want to change the regulatory landscape. I'd love to dig into the work you're doing with PG&E a little bit. Last year, you announced a smart charging pilot program for customers living in areas affected by power outages due to wildfire prevention measures. Tell us more about that pilot. Yeah. So, you know, it's a it's a it's a really great it's a really great pilot to demonstrate the fact that ultimately your mobility resiliency is increasingly going to be affected by your energy resiliency. And I think there are there are as you go as you go electric, you know, if the power goes out, there is actually going to be a challenge in getting to the places you want to get to. And so PG&E had this really great idea, which was like, look, how about we not only test, of course, the capabilities of how you manage the charging and so forth, but how about we layer in a new value stream, which is a question of resiliency. And particularly, again, when we think about mobility resiliency and it is a separate question, slightly separate question from energy resiliency. It is a question of how can I ensure that somebody is fully charged in a, you know, God forbid moment where you have to turn off the power to somebody's household? How can I ensure that they're fully charged and ready to go to that community shelter or drive down the road to grandma's house that may have power or, you know, you know, really in a in a in a very bad situation have to even evacuate? And I think the pilot was really kind of testing that out super successful. We were really able to both motivate customer behavior and and message and proactively communicate with folks that, hey, we're going to be fully charging you up at this moment because we anticipate that there might be a great event that comes along, which might challenge your which might challenge your resiliency, essentially. And of course, we didn't communicate it that exact way. But the point is that as we could see events coming on the horizon, we we were trying to be proactive in our communications and then even in our management of the customers charging. And and of course, that was with PG&E, a place that has to really deal on the deal and live with the front lines of what climate change is doing to overall grid resiliency. But but it can exist anywhere, right? We're testing storm mode, as we call it, with a partner on the East Coast that has hurricanes. We're, you know, we're thinking about a whole bunch of other places where these challenges are going to show up because we are living in a climate change world now. And like, the truth is, our existing infrastructure was not built to deal with much wider variances in temperature and wind conditions and all of that. So even design resiliency inherently in your system solution. That was a lot of what we were testing. And so far, you know, it's been going really well and the CPC has been really delighted by the results. So that's great. You also did an innovation plan with Dominion Energy. What is an innovation plan? What does it include? Yeah, I mean, the innovation incubator we did there is is it's a great way we did one with Dominion, we've done one with Duke. And I think the good thing about these these these places that that we've that we've worked closely with some of our partners is is to go in and I think really listen to the prospective customer. And what I think these accelerators, particularly utility accelerators, allow you to do is is to have that space and that access to folks who are keen to innovate but don't know how to go out and find go out and find innovative companies who are who are developing solutions that could be useful for them. And so they act as bridges. Right. And that's what the DIC Innovation Center that we did the innovation accelerator program that we did with Dominion was all about was kind of exposing us to stakeholders at Dominion that really are seeing a set of problems on the horizon and us kind of presenting our solution and saying, look, if it's valuable, let's talk. If it isn't, no worries. Like, we just got to find the right fit. And, yeah, I mean, things like that are a great gateway. And I think it's importantly, a really awesome way to speed up selling to utilities that historically, you know, everyone likes to say, oh, yeah, utilities are so slow. And it's like, well, they are if you're not selling them something they care about. And I think, you know, I think that's the same for me as well. I'm a slow buyer if you're selling me something I don't want. So I think it's about finding the right buyer and it's about finding somebody who really cares and thinks of it as their burning platform problem. So we're hearing a lot about AI machine learning, obviously with chat GPT and other technologies. And there's been some conversation around how that's going to impact utilities. I know that you all use machine learning AI to anticipate demand and aid in, you know, more EVs getting on the grid. You know, broadly, what role do you see emerging tech like ML and AI playing in the energy transition? I think and your background, of course, having worked at all the amazing places you worked at, you also know this too. But it's like, we need to get to a place where any kind of machine intelligence is ultimately there as an augmentation tool to currently human operators of the electric grid. Look, we're talking about an electric grid that is a far more complex grid than the one of yesteryear. You know, the grid that sort of started ending in 1973, circa the energy crisis, is going to look very different. Right. It does look very different from then. And of course, now requires a lot more balancing, a lot more predictions, a lot more machine operations combined with human in the loop thinking. And I think particularly when we think about the distribution system, that's where, again, that is sort of our soapbox and it's the thing we think a lot about, which is how do we imagine a world where that same feeder, that same transformer has several different vehicles on it? You know, five years ago, when I started the company, I would bring up that example and people would kind of laugh. They'd be like, no one's going to have that problem for like 20 years. And I was like, you clearly don't understand how exponential growth works. But okay. And today there are feeders in several parts of the country that are so overloaded that you cannot add a new electric vehicle on it. Right. So how can a distribution operator, how can someone sitting in a NOC actually both know that that problem is coming, perceive it to come, be able to proactively make decisions and have optimizations running. And then of course, you know, even better than know when whatever amount of load management and so forth you do is just not going to cut it where I need to know how to be able to roll out a truck so I can go upgrade something. You need to be able to provide that intelligence, especially when we move from a world where the, you know, 15, 20 LMPs that you had in your service territory were kind of all you needed to worry about and everything else was going to generally be fine. To now going to a world where you're thinking just critically about maybe 10 to the order of four, you know, distribution sub nodes, where there's constantly changing conditions. And I think, I think, you know, maybe back to my framework of applying a couple of controversial statements. But, but controversially, I think like we are getting to a world where distribution is going to be a larger and larger and eventually the dominant part of your electric bill. Which means that you do need machine intelligence to really start being able to predict and manage what happens at every single one of those sub nodes. And so why we built our software from day one to have that framework to be able to use forecasting and critical analytics and AI is because we just knew that if I look out to the world that I want to imagine, which is 280 million vehicles going all electric. Then there's no way that a human alone can make every decision intelligently. And so what we need to do is provide all the right tools to folks and the right insights and the right intelligence and of course the right optimizations such that those those vehicles can go electric and we can still sustain a reliable, affordable and clean electric grid. So when you look back on your career, what impact do you hope to have on the power industry? Yeah, that's a really good question. I hope that I hope that I've been able to bring some of the smartest people who are out there today. Working on things that are that are probably amusing to some of us that are interesting and entertaining. I hope that I'm able to bring more and more of that talent into caring about a problem that is going to affect lives of all of us for, you know, the next several decades to come. And in doing so can create the impact that makes makes a much better outcome for our kids and our grandkids and so forth. To me, like the thing that I've been most inspired by since starting Leaf Grid is the quality of talent that we've been able to bring into the sector, who is completely new, who had never thought about energy as a as a place they wanted to work. We've got people who are former machine learning scientists at NASA. We've got people who have worked at places like Google and Facebook and so forth and are working here now on optimizing the electric grid. That's just a very funny, funny thing to have happened. And I'm glad that we've been able to capture their imagination, but also put their incredible skills to use. So if you listen to the show, which it sounds like you do, you know, we always end with a question. So we call the show with great power, which is a nod to the power industry, but also the famous Spider-Man quote with great power comes great responsibility. Yeah, indeed. So what superpower do you bring to the energy transition? Yeah, I actually I actually listened to it and I got pretty excited by that question. So I think it comes back to this. It's I think my superpower is that I enjoy challenging the status quo while having empathy for why we are here today in the state that we're in. Look, I've been a constant immigrant my whole life, and so I've lived across different cultures. And so you kind of get used to change, but you also learn to appreciate different viewpoints. And I think electrification is truly one of those moments where everything changes from folks in the control room to the people interacting with customer programs and, of course, to the customers themselves. And so I think bridging those perspectives across technology, economics, the policy aspects, while still trying to push us forward to that more perfect future is what I love doing. And I think I'm rather good at it. Awesome. This has been a fascinating conversation. I really admire the work that Weebgrid is doing and thank you for your time. Come on the show. Likewise. Thanks, Brad. Apoorv Vargava is the CEO and co-founder of Weebgrid. With great powers produced by GridX in partnership with PostGrid Media. Delivering on our clean energy future is complex. GridX exists to simplify the journey. GridX is the enterprise rate platform that modern utilities rely on to usher in our clean energy future. We design and implement emerging rate structures and we increase consumer investment in clean energy, all while managing the complex building needs of a distributed grid. Our production team includes Aaron Hardick, Steven Lacey, Dalvin Abouaji, and Camille Stennis from PostGrid Media. The original theme song and mixing came from Sean Marquand. The GridX production team includes Jenny Barber and me, Brad Langley. If this show is providing value for you, and we really hope it is, we'd love it if you could help us spread the word. You can rate your reviews to Apple and Spotify, or you can share a link with a friend, colleague, or the energy nerd in your life. Thanks for listening. I'm Brad Langley."}, "podcast_summary": "In this podcast transcript, Apoorv Bhargava, CEO and co-founder of WeaveGrid, discusses his journey in the energy transition and the role of electric vehicles (EVs) in decarbonization. Bhargava explains that transportation and electricity combined account for over 60% of emissions and that the growing adoption of EVs presents an opportunity for large-scale decarbonization. However, the high costs of onboarding EVs to the grid can be a barrier. WeaveGrid aims to address this challenge by leveraging EVs as a grid resource, using data and software to optimize charging patterns and anticipate demand. Bhargava discusses the need for regulatory frameworks to adapt quickly to the changing landscape and the importance of collaboration between car companies, energy companies, and regulators. He also highlights the role of artificial intelligence and machine learning in managing the complexities of the modern electric grid and achieving a reliable, affordable, and clean energy system. Bhargava hopes that his work with WeaveGrid and the talent he brings to the sector will contribute to a better future for future generations.", "podcast_guest": "Apurva Bhargava", "podcast_highlights": "Interesting insights and critical questions from the podcast transcript:\n1. Apurva Bhargava recognized the need to push utilities for major strides towards decarbonization in order to achieve significant progress in the energy transition.\n2. The cost of onboarding millions of electric vehicles (EVs) onto the grid was a major challenge for utilities.\n3. WeaveGrid aims to leverage EVs as a grid resource that benefits drivers, utilities, and the grid as a whole.\n4. The role of WeaveGrid is to provide utilities with software to connect with current EV owners and optimize the charging process based on data analysis.\n5. The integration of transportation and electricity, particularly through EVs, has the potential to drive large-scale decarbonization.\n6. One of the challenges in the proliferation of EV technologies is the need to reimagine and re-architect the supply chain, build charging and grid infrastructure, and source critical minerals at a rapid pace.\n7. The collaboration between car companies and energy companies is crucial for the smooth transition to electric mobility, but there is a need for better synchronization and understanding between the two entities.\n8. Utilities and regulators need to adapt quickly to the exponential growth of EVs and proactively create regulatory frameworks that support innovative solutions and address the challenges of load management and grid resiliency.\n9. The integration of machine learning and AI technologies is essential in managing and optimizing the complex electric grid, especially in the distribution system, as the growth of EVs and other distributed energy resources requires intelligent decision-making and predictions.\n10. A key impact that Apurva Bhargava hopes to have on the power industry is to bring in talented individuals from diverse backgrounds who can contribute their skills and imagination to drive positive change in the energy transition.\n11. Challenge the status quo while having empathy for the current state of the industry and bridge perspectives across technology, economics, and policy to push towards a more sustainable future."}