{"podcast_details": {"podcast_title": "The Very Short Introductions Podcast", "episode_title": "Japanese Literature – The Very Short Introductions Podcast – Episode 70", "episode_image": "https://oxfordacademic.blubrry.net/wp-content/uploads/2023/04/the-very-short-introductions-podcast-logo-1.jpg", "episode_transcript": " Welcome back to the Very Short Introductions podcast. From public health to Buddhist ethics, soft matter to classics and art history to globalisation, we'll showcase a concise and original introduction to a wide range of subjects, wherever your curiosity may take you. So here is today's Very Short introduction. Hi, everybody. My name is Alan Tansman. I teach Japanese literature at the University of California at Berkeley. I was also for a while the director of Berkeley's Townsend Center for the Humanities. I've been teaching Japanese literature for 30, 35 years. So it's with that background and mostly teaching undergraduates the history of the literature that I came to write this VSI, which is called Japanese literature. The topic is vast. It's 1500 years of literature, and it deals with a variety of genres from poetry to literary treatise to theatre to popular literature to deeply mournful and sometimes sad poetry and writing about suffering to playfully and erotic popular literature. It starts in the eighth century. It goes to the late 20th, early 21st century. It concludes with a writer most people who read novels in the world now know, Murakami Haruki. But it covers a vast range of the most famous Japanese writers in the Japanese literary canon, some of whom I think audiences who would read this book would already know. But also it includes writers that, although famous in the Japanese tradition, are quite obscure outside of Japan. So one hope of the book is that people will get excited by my descriptions of these writers and their works and then go read them and read more works by the writers I mention. I first got interested in Japanese literature when I was a kid, late in high school. So that's over 40 years ago. And I read a novel called Kokoro, which means heart or spirit, written in 1914 by the Japanese writer Natsume Soseki. And he is treated in the book quite at length, two or three pages, which is a long stretch in a book like this. And what appealed to me then as a reader of American and European literature, mostly American and British literature, was that this was a novel that felt like a novel, but it felt very much like a strange novel, like a novel that came from a different world. So it was both familiar and at that time exotic. It was also a novel that was full of pain and suffering and the attempt by a writer to deal with his experience of becoming a modern person in a modern world and all the difficulties that that condition created for people in his world. So that was my first exposure to Japanese literature at a time when Japanese literature was not on the map among readers of world literature. Japan was not yet an economic power, but somehow it seemed both familiar, as I said, and very distant, which is what appealed to me. And still I realize after 35 years, it appeals to me. That is that we read Japanese literature and it seems to be like the literature we're used to, but it also seems to be different in important ways. One of those ways which I have always been interested in is how it's been influenced by Buddhism, which was imported to Japan from China and Korea in the sixth, seventh century, along with writing itself. That is, the Japanese had no form of writing until the import from China through Korea. So I've always been interested in how a Buddhist sensibility of the impermanence of things, of the passing away of all things, has infused Japanese writing. And it's always struck me that that may be different than the influences, the philosophical religious influences that have informed European, American, Latin American literatures. What I've also found myself interested in at an early age and to this day is the incredible importance of women's writing in Japanese literature. What many people believe to be the first novel in the world, although there were debates about this, some people talk about Cervantes, some talk about the Greek novel, but what many people and fans of Japanese literature talk about as the first novel in the world was called The Tale of Genji, written by a woman, Murasaki Shikibu in the 11th century. And this tradition of women's writing continues into the modern period. My first book, in fact, was about a woman writer whose name is Koda Aya, who was the daughter of a very famous male writer. And I've been interested in the literary relationships between women writers and their female and male predecessors. Something else that's always interested in me that informs my work and thinking about Japanese literature, which does relate to what I said a little bit earlier about the influence of China, is that from the beginning, Japanese literature has been infused and deeply informed by the thinking literature, religion and philosophy of places outside of Japan. For centuries, that place was China through Buddhism, but also through Chinese literary forms, Chinese poetic forms, Chinese thinking about literature that lasted, let's say, from the eighth century to the 19th century. It's a long time, over a thousand years. Then with the massive reading by Japanese writers and thinkers of European and American literature, thought, poetry, philosophy, et cetera, and the very quick and extensive and wonderful translations of works from outside of Japan into Japan, Japanese literature became a form that was not only influenced by early Chinese literary forms and by Buddhism, but now by European literary forms, the European novel, for example, and also Christian thought. So Japanese literature to me has always been a global literature, an amalgam of many, many forms. And it's one of the most exciting things about it is that any novel or any piece of work you can look at, you can see a whole world of literary work behind it. In thinking about the history of Japanese literature, I realized that I've been guided by what I've tried to transmit to students over my teaching career, not only in surveys of Japanese literature, but also in courses on individual writers. And what rises to the top in those years of teaching are specific writers who seem maybe most impenetrable, at the same time, most familiar to some readers outside of Japan. I'm thinking of people like Yukio Mishima, the many readers outside of Japan may know him, particularly a book of his that I really love from 1949 called Confessions of a Mask, which is a fictionalized memoir of a young man who's trying to come to terms with his nascent homosexuality and can barely bring it to consciousness. So it's a book about hiding behind masks. It's called Confessions of a Mask in order to reveal to himself in the world that he is gay in a world that does not accept it. So it's a very, very painful book about the sufferings of a young man trying to be authentic to himself. Mishima, many people will know, in 1970 committed a spectacular form of suicide. He disemboweled himself in a very ancient way and was beheaded. He wrote at the end of his life a tetrarchic at the end of his life, a tetralogy of works. In each of these novels, a main character dies and is reincarnated into the main character in the next novel. In the final fourth novel, we learn that the whole thing has been the whole world of these four novels has been a dream, has been a Buddhist dream. The day after he wrote the last page of the novel and sent the last page to his translator in the United States, Donald Keene, he committed suicide. So that was a shock to me as a kid and a shock to the Japanese reading public as well. So I've been interested in also not just the breadth of the tradition, but individual specific writers who seem to speak deeply within it, but broadly beyond it. So I would hope that reading snippets and descriptions of the breadth of Japanese literature with particular emphasis on specific writers that I have come to love or have found intriguing will interest readers most of all in reading the novels that I have mentioned and pursuing more deeply the writers I have talked about because it's a huge world of Japanese literary production that I've barely touched upon that I think will open up readers to the imagination of a great literary culture and have them reflect upon their own reading habits and their own thinking as human beings in the world. And I think that's one thing that Japanese literature, like all literatures do, is they allow us to think about the human condition through literary form. Thank you for listening to season six of the very short instructions podcast. Please stay tuned as we will be back with new episodes in October. In the meantime, you can subscribe to our podcast on your favourite app such as Apple or Spotify to receive all of our episodes directly in your feed. The very short instructions podcast can also be found on Soundcloud and YouTube at Oxford Academic."}, "podcast_summary": "In this podcast transcript, Alan Tansman, a professor of Japanese literature at the University of California Berkeley, discusses his book \"Japanese Literature\" from the Very Short Introductions series. He explains that Japanese literature spans 1500 years and covers a variety of genres, from poetry to theater to popular literature. Tansman highlights the influence of Buddhism on Japanese writing and the importance of women's writing in the tradition. He also discusses how Japanese literature has been shaped by outside influences, first through China and later through European and American literature. Tansman emphasizes specific writers, such as Yukio Mishima, who capture the complexity of Japanese literature and invites readers to explore the vast world of Japanese literary production. Overall, Japanese literature offers a unique perspective on the human condition through a diverse range of literary forms. The podcast concludes by encouraging listeners to subscribe to future episodes of the Very Short Introductions podcast.", "podcast_guest": "Alan Tansman", "podcast_highlights": "Interesting insights from the podcast transcript:\n\n1. Japanese literature is a vast and diverse topic that spans 1500 years and encompasses various genres like poetry, theatre, and popular literature.\n2. Buddhism has had a significant influence on Japanese literature, infusing it with a sensibility of impermanence and the passing away of things.\n3. Women's writing holds tremendous importance in Japanese literature, with some considering \"The Tale of Genji\" as the first novel in the world, written by a woman in the 11th century.\n4. Japanese literature has been influenced not only by Buddhism but also by Chinese literary forms, European literature, and Christian thought, making it a global literature with a rich amalgamation of different influences.\n5. Specific writers like Yukio Mishima, known for his book \"Confessions of a Mask,\" and Murakami Haruki have garnered international recognition and have delved deep into themes of personal identity and suffering.\n6. Japanese literature allows readers to reflect on the human condition and explore their own reading habits and thinking.\n\nCritical questions:\n\n1. How has Buddhism shaped the themes and motifs in Japanese literature throughout its history?\n2. In what ways has women's writing contributed to the development and evolution of Japanese literature?\n3. How has the globalization of literature impacted the contemporary Japanese literary scene?\n4. How do the works of specific writers like Yukio Mishima and Murakami Haruki challenge societal norms and explore personal identity?\n5. What are some lesser-known Japanese writers and works that are worth exploring?\n6. How does Japanese literature compare and contrast with other literary traditions from around the world?\n\nNote: The podcast transcript provides an overview of the author's perspective and interests in Japanese literature, which can serve as a starting point for further exploration and discussion."}